"Part1" = "简体中文";
"Part2" = "APPLE INC.";
"Part3" = "供iOS使用的SHORTCUTS 软件许可使用协议 ";
"Part4" = "在使用APPLE软件之前，务请仔细阅读本软件许可使用协议（“许可证”）。阁下一使用APPLE软件，即表示同意接受本许可证的条款约束。如阁下不同意本许可证的条款，请勿安装和/或使用软件。";
"Part5" = "重要提示:在本软件可用以复制、修改、发布和散发材料的范围内,阁下获许可只用以复制、修改、发布和散发没有著作权的材料、阁下拥有其著作权的材料、授权阁下或合法允许阁下复制、修改、发布或散发的材料。如阁下不肯定复制、修改、发布或散发任何材料副本的权利,应联络阁下的法律顾问。";
"Part6" = "1.  一般规定。    ";
"Part7" = "A. 本许可证所附的Apple软件和任何第三方软件、文件编制、接口、内容、字体及任何数据，不论是存储于只读存储器、任何其它载体或属任何其它形式(统称“Apple软件”)，是由Apple Inc.(“Apple”)许可阁下使用而非售予阁下，而且阁下只可根据本许可证的条款加以使用，Apple和/或 Apple 的许可人保留对 Apple 软件本身的所有权，以及保留一切并未明确授予阁下的权利。";
"Part8" = "B. Apple可对阁下Apple品牌兼容的iOS装置的Apple 软件酌情提供未来升级或更新版本，Apple 软件升级和更新版本(如有的话)未必包含Apple就较新版本或其它型号iOS装置发行的所有现有软件功能或新的功能。本许可证的条款将监管由 Apple 就原先 Apple 软件产品提供的任何软件升级或更新版本,除非该升级或更新版本另外连同独立许可证,在此情况下，阁下同意以该许可证监管该升级或更新版本。";
"Part9" = "2.  允许的许可使用方式和限制。    ";
"Part10" = "A. 许可证。在必须遵守本许可证条款和条件以及须得到Apple媒体服务条款和条件(https://www.apple.com/legal/internet-services/itunes/)所列的“服务和内容使用规则” (“使用规则”)允许的情况下, 除非阁下是如第2B条所述获取Apple 软件的，否则阁下获授予有限的、不可转让的非独家许可证，以在由阁下拥有或控制的、任何兼容的Apple品牌iOS装置上，安装和使用Apple软件。阁下不得在网络上分发或提供Apple软件，以致Apple软件在同一时间可供多台装置使用。阁下不得出租、租赁、出借、出售、再分发或再许可Apple 软件。 ";
"Part11" = "B. 批量或维修许可证。如阁下是通过与Apple签订批量或维修许可证计划获取Apple软件，阁下的批量或维修许可证条款将决定允许阁下在由阁下拥有或控制的Apple品牌iOS装置上下载、安装、使用和运行的Apple软件副本的份数。除Apple书面同意外，本许可证所有其他条款和条件均适用于阁下根据批量或维修许可证获取Apple软件的使用。";
"Part12" = "C. 系统要求。只有符合Apple指定系统要求的Apple品牌硬件，才会支持Apple软件。";
"Part13" = "D.  内容和数字材料。通过Apple软件显示或访问的任何内容（包括商标、标志和影像），其所有权和知识产权属于相关的内容所有权人。此等内容可能受著作权、商标或其他知识产权法律和条约保护，及可能须遵守提供该等内容的第三方使用条款。 除本许可证另有规定外，(i) 本许可证并不授予阁下使用该等内容的任何权利，亦不保证该等内容将继续提供给阁下，以及 (ii) 阁下不得以商业或其他方式独立使用、提取或分发Apple软件所包含或作为其一部分提供的任何图片、标志、文字、代码、影像、图形、艺术作品、音频、视频或类似资产 (“数字材料”)，或以其他方式在Apple软件预定用途情况以外使用数字材料。 ";
"Part14" = "E. 使用Shortcut。阁下承认操作所有应用程序和/或网站的快捷方式（“Shortcut”）,均由此类Shortcut源自的一方或多方独自负责。Apple无法控制任何第三方Shortcut的内容或功能，也不对此承担任何责任。阁下使用任何Shortcut须自担风险，并须独自负责遵守因阁下使用任何Shortcut而产生的任何第三方条款或协议。阁下承认Apple没有义务预先筛选Shortcut，但Apple保留自行酌情决定预先筛选、拒绝、禁用或删除任何Shortcut的权利。 ";
"Part15" = "F. 共享Shortcut。 Apple软件可让阁下通过网站链接与他人共享阁下创建的Shortcut。阁下的共享Shortcut及其中嵌入的任何内容将存储在Apple服务器上，以实现此类共享，并可用于总体改善Apple的产品和服务。阁下的共享Shortcut及其中嵌入的任何内容，将提供给可以访问该网站链接的任何人使用，然后他们可以复制、保存、修改和再分发阁下Shortcut一份副本，以及其中嵌入的所有内容。与他人共享Shortcut，即意味阁下表示：（1）阁下拥有此类Shortcut的所有必要权利和许可，并且该Shortcut不会侵犯或违反任何他方权利; 和（2）阁下与他人共享的任何Shortcut，不会违反任何法律、促成或鼓励侵权或其他形式的非法、或在其他方面淫秽或令人反感的行为。阁下承认Apple没有义务审查阁下与他人共享的任何Shortcut，但Apple保留自行酌情决定审查、禁用或删除阁下与他人共享任何Shortcut的权利。  ";
"Part16" = "G. 使用限制。阁下同意不会：上传、发布、以电子邮件方式发送、传输、与他人共享或以其他方式提供任何以下Shortcut：（1）非法、侵权、诽谤、粗俗、淫秽、中伤、或在种族、民族或其他方面令人反感的Shortcut; （2）违反、或鼓励任何可能违反任何适用法律或法规、或可能引起民事责任的行为的Shortcut; （3）宣扬歧视、偏见、种族歧视、仇恨、骚扰或伤害任何个人或群体的Shortcut; （4）暴力或威胁、或宣扬威胁任何他人的暴力或行为的Shortcut;（5）宣扬非法或有害活动的Shortcut;或（6）阁下知道或相信其为虚假、误导、欺诈、或以任何方式欺骗其使用者的Shortcut。阁下进一步同意，不会干扰或扰乱连接到阁下iOS装置上的Apple软件或任何第三方软件应用程序、服务或网站（“第三方App”）的服务器或网络、或对其造成不应有的负担、或违反此类网络或第三方App的政策或程序。";
"Part17" = "H. 第三方App。为了完成某些Shortcut，Apple软件可能需要访问某些第三方App。在有必要使用Apple软件以完成Shortcut的范围内，阁下明确同意并授权Apple软件代表阁下访问和使用这些第三方App。在Apple软件访问任何第三方App的范围内，Apple没有须为此类第三方App提供任何技术或其他支持的明示或默示义务。对于与其软件、服务、网站和/或产品有关的技术支持和客户服务，请直接联系相应的软件供应商、制造商或服务提供商。阁下进一步同意，在使用APPLE软件时，阁下须受这些第三方APP的所有适用服务条款或其他协议约束，并同意予以遵守。对于SHORTCUT使用的每一个第三方APP，阁下须自行负责确保所有SHORTCUT均遵守其适用条款。APPLE不在任何方面保证SHORTCUT遵守任何第三方APP的条款，对于任何第三方SHORTCUT，APPLE不承担任何责任。 ";
"Part18" = "I. 不得倒序制造。阁下不得且阁下同意不会或让其他人复制(本许可证或如适用于阁下的使用规则明示允许除外)、反汇编、倒序制造、拆装、企图导出其源代码、解码、修改Apple软件或创建其衍生作品、或Apple软件提供的任何服务或其任何部分（适用法律禁止任何前述限制除外，或包括在Apple软件内的开放源组件使用许可证条款允许除外）。";
"Part19" = "J. 遵守法律。阁下同意使用Apple软件和服务（定义见以下第4条）须遵守所有适用法律，包括在阁下居住或在阁下下载或使用Apple软件和服务的国家或地区的当地法律。";
"Part20" = "K. 自动更新。 如阁下选择允许自动更新app，阁下的装置会就Apple软件的更新版本和升级版本向Apple定期查询。如有提供更新版本或升级版本，该更新版本或升级版本会自动下载和安装到阁下的装置上，以及阁下的外围装置（如适用）。任何时候阁下均可完全关闭自动更新app，只需更改Settings项下的自动更新app设定。";
"Part21" = "3.同意使用数据。";
"Part22" = "A. 分析数据。如阁下选择收集分析数据，阁下同意Apple及其子公司和代理可以收集、维护、处理和使用诊断性、技术性、使用及相关信息，包括但不限于定期搜集独特的系统或硬件识别码、关于阁下的iOS装置、计算机、系统和应用软件以及外围设备的信息，以便提供和改善Apple的产品和服务、向阁下提供与Apple软件有关的软件更新、产品支持和其它服务(如果有) ，以及用以核实本许可证条款的遵守情况。Apple可基于上述目的使用此等信息，只要其收集形式不会将阁下本人识别出来。为便于Apple的伙伴和第三方开发者改善其设计配合Apple产品使用的软件、硬件和服务，Apple并可向任何此类伙伴或第三方开发者提供与该伙伴或第三方开发者的软件、硬件和/或服务有关的诊断信息子集，只要诊断信息的形式不会将阁下本人识别出来。 ";
"Part23" = "B. 定位数据。Apple及其伙伴、被许可人和第三方开发者可能通过Apple 软件提供依赖定位信息的某些服务。为提供和改善这些服务，Apple及其伙伴、被许可人和第三方开发者可能传输、收集、维护、处理和使用阁下的定位数据（如有）。Apple收集定位数据和查询的方式不会将阁下本人识别出来，并可由Apple及其伙伴、被许可人和第三方开发者用以提供和改善基于定位的产品和服务。阁下使用任何由或通过Apple软件提供的基于定位的服务，即表示同意和允许Apple及其伙伴、被许可人和第三方开发者传输、收集、维护、处理和使用阁下的定位数据和查询，以便提供和改善这些产品和服务。阁下可随时撤销此项允许，只需前往阁下iOS装置上的定位服务设定并关掉全球定位服务设定，或关掉Apple软件的个别定位设定。在iOS装置上使用使用或提供定位数据的第三方应用程序或服务时，阁下须遵守并应查阅此类第三方应用程序或服务对于使用定位数据的第三方条款和隐私政策。";
"Part24" = "C. 隐私政策。任何时候，阁下的信息将会依照Apple的隐私政策处理，该政策可在https://www.apple.com/legal/privacy/查阅。";
"Part25" = "4. 服务和第三方材料。";
"Part26" = "A. 一般规定。Apple软件能使阁下访问Apple的iTunes Store、App Store、iCloud、地图及其他 Apple和第三方服务及网址(以下统称及个别称为“服务”)。该等服务不会以所有语言或在所有国家地区提供。使用这些服务需要接入互联网，而且使用某些服务可能需要一个Apple ID，可能要求阁下接受附加服务条款和条件，并可能须缴交附加费用。阁下就iTunes Store账户、Apple ID或其他Apple服务使用本软件，即表示同意接受该服务的适用服务条款(例如Apple媒体服务最新的条款和条件)，阁下可在https://www.apple.com/legal/internet-services/itunes/访问和查阅该等条款和条件。";
"Part27" = "B. 如阁下选择通过Apple软件使用iCloud服务，该等使用须遵守以下的额外条款：iCloud条款和条件，可在https://www.apple.com/legal/internet-services/icloud/查阅；和Apple的隐私政策，可在https://www.apple.com/legal/privacy/查阅。";
"Part28" = "C. 阁下明白，使用任何服务意味阁下或会遇到可能被视为冒犯性、猥亵或讨厌的内容，这些内容可能使用或不使用直白的语言。尽管如此，阁下同意使用服务并自担风险，对于可能被发现属冒犯性、猥亵或讨厌的内容，Apple不向阁下承担任何责任。";
"Part29" = "D. 某些服务可能显示、包含或提供来自第三方的服务、内容、数据、信息、应用程序或材料( “第三方材料”)，或提供至某些第三方网站或应用程序的链接。阁下一使用服务，即表示阁下承认并同意，Apple不负责检查或评估此等第三方材料、应用程序或网站的内容、准确性、完整性、及时性、有效性、符合版权规定、合法性、适当性或质量，或任何其它方面。对任何第三方服务、第三方材料、应用程序或网站，或者第三方的任何其它材料、产品或服务，Apple 及其管理人员、关联公司和子公司不作任何保证或认可，亦不对阁下或任何其它人承担和负有任何责任或负责。第三方材料和至其它网站或应用程序的链接仅为方便阁下而提供。";
"Part30" = "E. 在阁下使用服务上传任何内容的范围内，阁下声明阁下拥有所有权利或得到授权或以其他方式获法律允许上传该等内容，以及该等内容不违反适用于服务的任何服务条款。阁下同意，服务含有属Apple、网站所有人和/或其许可人拥有的专有内容、信息和材料（包括但不限于任何数字材料），受适用的知识产权和其它法律保护，包括但不限于版权。阁下同意除服务的允许用途外,阁下不会使用此等专有内容、信息或材料,也不以任何与本许可证的条款不一致或侵犯第三方或Apple的任何知识产权的方式使用此等专有信息或材料。服务的任何部分，均不得以任何形式或以任何方式复制。阁下同意不以任何方式修改、出租、租赁、借出、销售或分发服务，亦不以任何方式以服务为基础创作任何衍生作品。阁下不得以任何未获授权的方式利用服务，包括但不限于使用服务传播计算机病毒、蠕虫、特洛伊木马或其它恶意软件,或者侵入网络或加重网络容量负担。阁下进一步同意不以任何方式使用服务骚扰、辱骂、追踪、威胁或诽谤任何其他方,或以侵犯或违反任何其他方权利的方式使用服务。对于阁下的任何此等使用或由于使用服务致使阁下可能收到的任何骚扰性、威胁性、诽谤性、冒犯性、侵权或非法信息或传播,Apple不在任何方面对阁下承担任何责任。";
"Part31" = "F. 此外，通过Apple软件访问、链接或显示的服务和第三方材料不会以所有语言或在所有国家或地区提供。Apple不声明此等服务和第三方材料为适当的及可在任何特定地点提供使用。在阁下选择使用或访问此等服务和第三方材料的范围内，阁下是自主决定这样做的，并负责遵守任何适用法律，包括但不限于适用的地方法律，以及隐私和数据收集法律。Apple及其许可人保留在不通知的情况下，随时更改、暂停、取消或禁止访问任何服务的权利。在任何情况下，Apple均不对取消或禁止访问任何此等服务负有责任。Apple还可在任何情况下，不通知和不承担责任地限制使用或访问某些服务。 ";
"Part32" = "5.  终止。    本许可证在其终止之前有效。如阁下未能遵守本许可证中的任何条款，本许可证下阁下的权利将自动终止或以其它方式停止生效，而无需Apple另行通知。在本许可证终止时，阁下应停止对Apple软件的任何使用行为, 并销毁Apple软件的任何全部或部分的复制本。本许可证第2I、3、4、5、6、7、8、10和11条在如此终止后继续有效。";
"Part33" = "6.  不作出担保。    ";
"Part34" = "A. 如阁下是消费者客户(指在阁下的行业、业务或专业以外使用Apple软件的人) ,阁下在居住国可能享有法定权利,禁止以下限制适用于阁下。这些限制若被禁止即不适用于阁下。要进一步 了解相关的消费者权利,阁下应联系当地的消费者咨询组织。";
"Part35" = "B. 阁下明确认识到并同意，在适用法律允许的范围内，就阁下对APPLE软件的使用和通过APPLE软件执行或访问的任何服务, 阁下须自担风险，而有关质量满意度、性能、准确性及努力等方面的全部风险均由阁下承担。";
"Part36" = "C. 在适用法律允许的最大范围内，APPLE软件和服务是“按现状”和“可提供情况”提供的，附有一切瑕疵而不带有任何种类的担保；APPLE和APPLE的许可人(为第6和7条目的统称为“APPLE”)特此否认就APPLE软件和服务提供任何明示、默示或法定担保和条件，这包括但不限于有关适销性、质量满意度、适合作某特定用途、准确性、不受干扰地享用及不侵害第三方权利的默示担保和／或条件。";
"Part37" = "D. APPLE并不担保阁下可不受干扰地享用APPLE软件和服务、APPLE软件包含的功能或所执行或提供的服务会符合阁下的要求、APPLE软件或服务将不受干扰地操作而且毫无错误、任何服务将持续提供、APPLE软件或服务将被纠正、或APPLE软件可与任何第三方软件、应用程序或第三方服务兼容或共同运作。安装本APPLE软件可能影响第三方软件、应用程序或第三方服务以及APPLE产品和服务的可得性及可用性。";
"Part38" = "E. 阁下进一步承认，APPLE软件和服务并非专为用于若APPLE软件或服务出现故障或时间延误、或所提供的内容、数据或信息出现错误或不准确之处时，可能会导致人身伤亡或严重的有形或环境损害的情况或环境，包括但不限于操作核子设施、飞机导航或通信系统、空中交通管制系统、生命维持机器或武器系统。";
"Part39" = "F. APPLE或APPLE授权代表给予的口头或书面的信息或意见均不构成任何担保。如发现APPLE软件或服务存有瑕疵，阁下须承担所有必要的维修、修理或纠正的全部费用。有些国家地区不允许排除默示担保或对消费者的适用法定权利加以限制的做法，因此上述排除和限制可能并不适用于阁下。";
"Part40" = "7.  责任限制。    在适用法律不禁止的范围内，在任何情况下，对由于阁下使用或无法使用APPLE软件和服务、或与APPLE软件共同使用或无法共同使用任何第三方软件或应用程序所引起或与此有关的任何人身伤害或任何附带的、特别的、间接的或后果性的损害赔偿，包括但不限于利润损失、数据损坏或损失、未能传输或接收任何数据、业务中断的损害赔偿或任何其它商业损害赔偿或损失，无论其成因及基于何种责任理论(合同、侵权或其它)，APPLE概无须负责，即使APPLE已知悉可能发生上述损害赔偿的话。有些国家地区不允许对人身伤害，或附带或后果性损害赔偿排除或附加责任限制，因此此项限制可能并不适用于阁下。在任何情况下，Apple就所有损害赔偿对阁下承担的全部责任(不包括在涉及人身伤害的情况中根据适用法律规定而作出的损害赔偿)不应超过五十美元(US$50.00)。即使前述救济失去其基本作用，上述责任限制仍将适用。";
"Part41" = "8.  出口控制。    除美国法律及获得Apple软件的所在国家地区的法律授权外，阁下不得使用或以任何方式出口或转口Apple软件。特别是(但不以此为限)Apple软件不得出口或转口(a)到任何遭美国禁运的国家，或(b)给美国财政部的特别指定国民名单或美国商务部的被禁人士或机构名单或任何其它受限制方名单上任何人士。阁下使用Apple软件，即表示阁下声明和保证阁下并非位于上述任何国家，或列入上述任何名单。阁下并同意不会使用Apple软件于美国法律禁止使用的任何目的，包括但不限于发展、设计、制造或生产导弹、核武器或化学或生物武器。";
"Part42" = "9.  政府最终用户。    Apple软件和有关文文件均属“商业项目”，该词定义见48 C.F.R. §2.101，包含“商用计算机软件”和“商用计算机软件文档”，定义见48 C.F.R. §12.212或48 C.F.R. §227.7202，以适用者为准。在符合48 C.F.R. §12.212或48 C.F.R. §227.7202-1至227.7202 4(以适用者为准)的规定下，商用计算机软件和商用计算机软件文档(a)只作为商业项目许可美国政府的最终用户使用，及(b)只附有根据本许可证条款和条件授予所有其它最终用户的权利。Apple根据美国的著作权法律保留任何未经发布的权利。";
"Part43" = "10.  管辖法律和可分割性。     本许可证受美国加利福尼亚州法律管辖并按该等法律解释,但该州的法律冲突原则除外。本许可证不受《联合国国际货物销售合同公约》管辖，其对本许可证的适用在此明确排除。如阁下是英国消费者，本许可证将受对阁下居住国家地区具司法管辖权的法律管辖。如果基于任何原因,具有合法管辖权的法院裁定本许可证的任何条款或其任何部分不可被强制执行，本许可证的其余规定应继续充分有效。";
"Part44" = "11.  全部协议；管辖语言。    本许可证构成阁下与Apple之间有关Apple软件的全部协议，并取代与该标的事项有关的以前或现在的所有谅解。未经Apple签署书面文件,对本许可证的任何修订或修改不具约束力。本许可证的任何译本仅仅为了满足当地需要。如果英文本与任何非英文译本有任何抵触之处，在阁下所在国家地区当地法律不禁止的范围内，应以本许可证的英文本为准。                                                                                                                     ";
"Part45" = "12.  第三方确认。    Apple软件的若干部分可能使用或包含第三方的软件及其它享有著作权的材料。Apple软件所附的电子文件中载明有关该等材料的确认、许可条款及不承担责任声明，阁下对该等材料的使用受有关的条款管辖。";
"Part46" = "EA1576";
"Part47" = "2018年8月16日";